iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_i2c_driver.c
/***********************************************************************
 * $Id: lpc23xx_i2c_driver.c 28 2014-01-27 14:45:13Z danielru $
 * 
 * Project: LPC23xx I2C driver
 *
 * Description:
 *     This file contains driver support for the I2C modules on the
 *     LPC23xx
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only  
 * which provides customers with programming information regarding the  
 * products. This software is supplied "AS IS" without any warranties.  
 * NXP Semiconductors assumes no responsibility or liability for the 
 * use of the software, conveys no license or title under any patent, 
 * copyright, or mask work right to the product. NXP Semiconductors 
 * reserves the right to make changes in the software without 
 * notification. NXP Semiconductors also make no representation or 
 * warranty that such application will be suitable for the specified 
 * use without further testing or modification. 
 **********************************************************************/
#include "lpc23xx_i2c_driver.h"
#include "lpc23xx_scb_driver.h"
#include "lpc23xx_vic_driver.h"
#include "lpc23xx_pinsel_driver.h"

/***********************************************************************
 * Private I2C data type and functions
***********************************************************************/

/***********************************************************************
 * I2C device configuration structure type
***********************************************************************/
typedef struct
{
	I2C_Type  	*regptr;    			/* Pointer to I2C registers */
	U8			slaveaddr;				/* current slave address used in master mode */
	BOOL32		mastermode;				/* Mode in use, 0 = slave, 1 = master */
    U8*			datptr;					/* Data pointer */
    U32			length;					/* Length of current data */
    U32			idx;					/* Current index data */
    void		(*handler)(S32 I2Cdev); /* Transmission interrupt handler pointer*/
    void		(*cbs)(void);			/* Call back function pointer */
    BOOL32     	init;       			/* Device initialized flag */
    U32			status;					/* Current status of device on I2C bus */
} I2C_CFG_T;

/* I2C driver data in structure for I2C0, I2C1 and I2C2 controller */
STATIC I2C_CFG_T i2ccfgdat[3] = {
	{(I2C_Type *) 0, 0, TRUE, NULL, 0, 0, NULL, NULL, FALSE, 0},
	{(I2C_Type *) 0, 0, TRUE, NULL, 0, 0, NULL, NULL, FALSE, 0},
	{(I2C_Type *) 0, 0, TRUE, NULL, 0, 0, NULL, NULL, FALSE, 0}
	};

/***********************************************************************
 * Private I2C function declaration
***********************************************************************/

/* Generate a start condition on I2C bus (in master mode only) */
U32 I2C_Start (I2C_Type *i2cdev);

/* Generate a stop condition on I2C bus (in master mode only) */
void I2C_Stop (I2C_Type *i2cdev);

/* I2C send byte subroutine */
U32 I2C_SendByte (I2C_Type *i2cdev, U8 databyte);

/* I2C get byte subroutine */
U32 I2C_GetByte (I2C_Type *i2cdev, U8 *retdat, BOOL32 ack);

/* I2C interrupt master transmit handler */ 
void I2C_MTXHandler (S32 I2Cdev);

/* I2C interrupt master receive handler */ 
void I2C_MRXHandler(S32 I2Cdev);

/* I2C interrupt slave transmit handler */ 
void I2C_STXHandler(S32 I2Cdev);

/* I2C interrupt slave receive handler */ 
void I2C_SRXHandler(S32 I2Cdev);

/* Enable interrupt for I2C device */
void I2C_EnableInt (S32 I2Cdev);

/* Disable interrupt for I2C device */
void I2C_DisableInt (S32 I2Cdev);


/***********************************************************************
 * Function: I2C_Start
 * Purpose: Generate a start condition on I2C bus (in master mode only)
 * Parameters:
 *     i2cdev: Pointer to I2C register
 * Returns: value of I2C status register after generate a start condition
 **********************************************************************/
U32 I2C_Start (I2C_Type *i2cdev)
{
	i2cdev->I2CONCLR = I2CON_SI;
	i2cdev->I2CONSET = I2CON_STA;
	while (!(i2cdev->I2CONSET & I2CON_SI));
	i2cdev->I2CONCLR = I2CON_STA;
	return i2cdev->I2STAT;
}


/***********************************************************************
 * Function: I2C_Stop
 * Purpose: Generate a stop condition on I2C bus (in master mode only)
 * Parameters:
 *     i2cdev: Pointer to I2C register
 * Returns: None
 **********************************************************************/
void I2C_Stop (I2C_Type * i2cdev)
{
	i2cdev->I2CONSET = I2CON_STO;
	i2cdev->I2CONCLR = I2CON_SI;
}


/***********************************************************************
 * Function: I2C_SendByte
 * Purpose: Send a byte
 * Parameters:
 *     i2cdev: Pointer to I2C register
 * Returns: value of I2C status register after sending
 **********************************************************************/
U32 I2C_SendByte (I2C_Type *i2cdev, U8 databyte)
{
	i2cdev->I2DAT = (U32) databyte;
	i2cdev->I2CONCLR = I2CON_SI;
	while (!(i2cdev->I2CONSET & I2CON_SI));
	return i2cdev->I2STAT;
}


/***********************************************************************
 * Function: I2C_GetByte
 * Purpose: Get a byte
 * Parameters:
 *     i2cdev: Pointer to I2C register
 * Returns: value of I2C status register after receiving
 **********************************************************************/
U32 I2C_GetByte (I2C_Type *i2cdev, U8 *retdat, BOOL32 ack)
{
	if (ack == TRUE)
	{
		i2cdev->I2CONSET = I2CON_AA;		
	}
	else 
	{
		i2cdev->I2CONCLR = I2CON_AA;
	}
	i2cdev->I2CONCLR = I2CON_SI;
	while (!(i2cdev->I2CONSET & I2CON_SI));
	*retdat = (U8) i2cdev->I2DAT;
	return i2cdev->I2STAT;
}


/***********************************************************************
 * Function: I2C_MTXHandler
 * Purpose: I2C interrupt master transmit handler
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * Returns: None
 **********************************************************************/
void I2C_MTXHandler (S32 I2Cdev)
{
    I2C_CFG_T *device = (I2C_CFG_T *) I2Cdev;
    
    // Handle next operation according to current I2S status
    switch (device->regptr->I2STAT)
    {
    /* A start condition has been transmitted */
	case I2STAT_MSTR_TRSMT_START:
		/*Busy = 1, Done = 0*/
		/*Send slave addr + RD bit*/
		device->status = I2C_STATUS_BUSY | I2STAT_MSTR_TRSMT_START;
		device->regptr->I2CONCLR = I2CON_STA;
		device->regptr->I2DAT = (U32)(device->slaveaddr);
		device->regptr->I2CONCLR = I2CON_SI;
		break;
		
	/* A repeat start condition has been transmitted */
	case I2STAT_MSTR_TRSMT_RESTART:
		/*Busy = 1, Done = 0*/
		/*Send slave addr + RD bit*/
		device->status = I2C_STATUS_BUSY | I2STAT_MSTR_TRSMT_RESTART;
		device->regptr->I2CONCLR = I2CON_STA;
		device->regptr->I2DAT = (U32)(device->slaveaddr);
		device->regptr->I2CONCLR = I2CON_SI;
		break;
		
