iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_i2c_driver.c
	/* SLA+W has been transmitted, ACK has been received */
	case I2STAT_MSTR_TRSMT_SLAW_ACK:
		if (device->idx < device->length)
		{
			/*Busy = 1, Done = 0*/
			/*Send more data*/
			device->status = I2C_STATUS_BUSY | I2STAT_MSTR_TRSMT_SLAW_ACK;
			device->regptr->I2DAT = (U32) *(device->datptr + device->idx);
			device->idx++;
			device->regptr->I2CONCLR = I2CON_SI;
		}	
		else
		{
			/*Busy = 0, Done = 1*/
			/*Last data has been sent, STOP will be generated*/
			device->status = I2C_STATUS_DONE | I2STAT_MSTR_TRSMT_SLAW_ACK;
			device->regptr->I2CONSET = I2CON_STO;
			device->regptr->I2CONCLR = I2CON_SI;
			/* Call callback function */
			device->cbs();
			I2C_DisableInt (I2Cdev);
		}
		break;
		
	/* SLA+W has been transmitted, NACK has been received */
	case I2STAT_MSTR_TRSMT_SLAW_NACK:
		/*Busy = 0, Done = 0*/
		/*STOP will be generated*/
		device->status = I2STAT_MSTR_TRSMT_SLAW_NACK | I2C_STATUS_ERROR;
		device->regptr->I2CONSET = I2CON_STO;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		I2C_DisableInt (I2Cdev);
		break;
		
	/* Data has been transmitted, ACK has been received */
	case I2STAT_MSTR_TRSMT_DAT_ACK:
		if (device->idx < device->length)
		{
			/*Busy = 1, Done = 0*/
			/*Send more data*/
			device->status = I2C_STATUS_BUSY | I2STAT_MSTR_TRSMT_DAT_ACK;
			device->regptr->I2DAT = (U32) *(device->datptr + device->idx);
			device->idx++;
			device->regptr->I2CONCLR = I2CON_SI;
		}	
		else
		{
			/*Busy = 0, Done = 1*/
			/*Last data has been sent, STOP will be generated*/
			device->status = I2C_STATUS_DONE | I2STAT_MSTR_TRSMT_DAT_ACK;
			device->regptr->I2CONSET = I2CON_STO;
			device->regptr->I2CONCLR = I2CON_SI;
			/* Call callback function */
			device->cbs();
			I2C_DisableInt (I2Cdev);
		}
		break;
		
	/* Data has been transmitted, NACK has been received */
	case I2STAT_MSTR_TRSMT_DAT_NACK:
		/*Busy = 0, Done = 0*/
		/*NACK has been received, STOP will be generated*/
		device->status = I2STAT_MSTR_TRSMT_DAT_NACK | I2C_STATUS_ERROR;
		device->regptr->I2CONSET = I2CON_STO;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		I2C_DisableInt (I2Cdev);
		break;
		
	/* Arbitration lost in SLA+R/W or Data bytes */
	case I2STAT_MSTR_TRSMT_ARB_LOST:
		/*Busy = 0, Done = 0, ARBF = 1*/
		/*Release I2C bus, enter not addressed slave mode*/
		device->status = I2STAT_MSTR_TRSMT_ARB_LOST | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
		
	// Other status must be captured
	default:
		/* Else... */
		device->status = device->regptr->I2STAT | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		I2C_DisableInt (I2Cdev);
		break;
    }
    return;
}


/***********************************************************************
 * Function: I2C_MRXHandler
 * Purpose: I2C interrupt master receive handler
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * Returns: None
 **********************************************************************/
void I2C_MRXHandler(S32 I2Cdev)
{
	I2C_CFG_T *device = (I2C_CFG_T *) I2Cdev;

	// Handle next operation according to current I2S status
    switch (device->regptr->I2STAT)
    {
    /* A start condition has been transmitted */
    case I2STAT_MSTR_RCV_START:
		/*Busy = 1, Done = 0*/
		/*Send slave addr + WR bit*/
		device->status = I2C_STATUS_BUSY | I2STAT_MSTR_RCV_START;
		device->regptr->I2DAT = device->slaveaddr | 0x01;
		device->regptr->I2CONCLR = I2CON_STA | I2CON_SI;
		break;
		
	/* A repeat start condition has been transmitted */
	case I2STAT_MSTR_RCV_RESTART:
		/*Busy = 1, Done = 0*/
		/*Send slave addr + WR bit*/
		device->status = I2C_STATUS_BUSY | I2STAT_MSTR_RCV_RESTART;
		device->regptr->I2DAT = device->slaveaddr | 0x01;
		device->regptr->I2CONCLR = I2CON_STA | I2CON_SI;		
		break;
		
	/* Arbitration lost */
	case I2STAT_MSTR_RCV_ARB_LOST:
		/*Arbitration lost, enter not addressed slave mode*/
		/*Busy = 0, Done = 0*/
		device->status = I2STAT_MSTR_RCV_ARB_LOST | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = I2CON_STA | I2CON_SI;
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
		
	/* SLA+R has been transmitted, ACK has been received */
	case I2STAT_MSTR_RCV_SLAR_ACK:
		if ((device->idx) < (device->length - 1))
		{
			/*Data will be received,  ACK will be return*/
			device->regptr->I2CONSET = I2CON_AA;
		}
		else
		{
			/*Last data will be received,  NACK will be return*/
			device->regptr->I2CONCLR = I2CON_AA;
		}
		/*Busy = 1, Done = 0*/
		device->status = I2C_STATUS_BUSY | I2STAT_MSTR_RCV_SLAR_ACK;
		device->regptr->I2CONCLR = I2CON_SI;
		break;
		
	/* SLA+R has been transmitted, NACK has been received */
	case I2STAT_MSTR_RCV_SLAR_NACK:
		/*Busy = 0, Done = 0*/
		device->status = I2STAT_MSTR_RCV_SLAR_NACK | I2C_STATUS_ERROR;
		/*STOP will be generated*/
		device->regptr->I2CONSET = I2CON_STO;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		I2C_DisableInt (I2Cdev);
		break;
		
	/* Data has been received, ACK has been returned */
	case I2STAT_MSTR_RCV_DAT_ACK:
		/* Save data from bufreg */
		*(device->datptr + device->idx) = (U8) device->regptr->I2DAT;
		device->idx++;
		if ((device->idx) < (device->length - 1))
		{
			/*Data will be received,  ACK will be return*/
			device->regptr->I2CONSET = I2CON_AA;
		}
		else
		{
			/*Last data will be received,  NACK will be return*/
			device->regptr->I2CONCLR = I2CON_AA;
		}
		/*Busy = 1, Done = 0*/
		device->status = I2C_STATUS_BUSY | I2STAT_MSTR_RCV_DAT_ACK;
		device->regptr->I2CONCLR = I2CON_SI;
		break;
		
	/*Data has been received, NACK has been return */
	case I2STAT_MSTR_RCV_DAT_NACK:
		/* Save data from bufreg */
		*(device->datptr + device->idx) = (U8) device->regptr->I2DAT;
		/*Busy = 0, Done = 1*/
		device->status = I2C_STATUS_DONE | I2STAT_MSTR_RCV_DAT_NACK;
		/* STOP will be generated */
		device->regptr->I2CONSET = I2CON_STO;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		I2C_DisableInt (I2Cdev);
		break;
	
	// Other status must be captured
	default:
		/* Else... */
		device->status = device->regptr->I2STAT | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = I2CON_SI;
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
    }
}


/***********************************************************************
 * Function: I2C_STXHandler
 * Purpose: I2C interrupt slave transmit handler
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * Returns: None
 **********************************************************************/
void I2C_STXHandler(S32 I2Cdev)
{
	I2C_CFG_T *device = (I2C_CFG_T *) I2Cdev;
	
	switch (device->regptr->I2STAT)
	{
	/* Own SLA+R has been received, ACK has been returned */
	case I2STAT_SLV_TRSMT_SLAR_ACK:	
		/* BUSY = 1, DONE = 0 */
		device->status = I2C_STATUS_BUSY | I2STAT_SLV_TRSMT_SLAR_ACK;
		if (device->idx < device->length)
		{
			device->regptr->I2DAT = (U32) *(device->datptr + device->idx);
			device->idx++;
		}
		device->regptr->I2CONSET = I2CON_AA;
		device->regptr->I2CONCLR = I2CON_SI;
		break;	 
	
	/* Data has been transmitted, ACK has been received */
	case I2STAT_SLV_TRSMT_DAT_ACK:
		/* BUSY = 1, DONE = 0 */
		device->status = I2C_STATUS_BUSY | I2STAT_SLV_TRSMT_DAT_ACK;
		if (device->idx < device->length)
		{
			device->regptr->I2DAT = (U32) *(device->datptr + device->idx);
			device->idx++;
		}	    			
		device->regptr->I2CONSET = I2CON_AA;
		device->regptr->I2CONCLR = I2CON_SI;
		break;	
		
	/* Data has been transmitted, NACK has been received */	
	case I2STAT_SLV_TRSMT_DAT_NACK:
		/* BUSY = 0, DONE = 1 */
		device->status = I2C_STATUS_DONE | I2STAT_SLV_TRSMT_DAT_NACK;
		device->regptr->I2CONCLR = (I2CON_SI | I2CON_AA);
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
		
	/* Else... */	
	default:		
		/* BUSY = 0, DONE = 0 */
		device->status = device->regptr->I2STAT | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = (I2CON_SI | I2CON_AA);
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
	}
}


/***********************************************************************
 * Function: I2C_SRXHandler
 * Purpose: I2C interrupt slave receive handler
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * Returns: None
 **********************************************************************/
void I2C_SRXHandler(S32 I2Cdev)
{
	I2C_CFG_T *device = (I2C_CFG_T *) I2Cdev;
	
	switch (device->regptr->I2STAT)
	{
	/* Own slave address has been received, ACK has been returned */
	case I2STAT_SLV_RCV_SLAW_ACK:
		/* BUSY = 1, DONE = 0 */
		device->status = I2C_STATUS_BUSY | I2STAT_SLV_RCV_SLAW_ACK;
		device->regptr->I2CONSET = I2CON_AA;
		device->regptr->I2CONCLR = I2CON_SI;
		break;
	
	/* Data has been received, ACK has been return */
	case I2STAT_SLV_RCV_PRE_SLA_DAT_ACK: 
		/* BUSY = 1, DONE = 0 */
		device->status = I2C_STATUS_BUSY | I2STAT_SLV_RCV_PRE_SLA_DAT_ACK;
		if (device->idx < device->length)
		{
			*(device->datptr + device->idx) = (U8) device->regptr->I2DAT;
			device->idx++;
		}
		/* if received data length is greater than specified length
		 * all next data will be lost */ 
		device->regptr->I2CONSET = I2CON_AA;
		device->regptr->I2CONCLR = I2CON_SI;
		break;
		
