iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_i2c_driver.c
	/* Data has been received and NOT ACK has been return */
	case I2STAT_SLV_RCV_PRE_SLA_DAT_NACK:
		/* BUSY = 0, DONE = 0 */
		device->status = I2STAT_SLV_RCV_PRE_SLA_DAT_NACK | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = (I2CON_SI | I2CON_AA);
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;	 		

	/* General call address has been received, ACK has been returned */
	case I2STAT_SLV_RCV_GENCALL_ACK:
		/* BUSY = 1, DONE = 0 */
		device->status = I2C_STATUS_BUSY | I2STAT_SLV_RCV_GENCALL_ACK;
		device->regptr->I2CONSET = I2CON_AA;
		device->regptr->I2CONCLR = I2CON_SI;
		break;
	
	/* Data has been received and ACK has been return
	 * as general call address */
	case I2STAT_SLV_RCV_PRE_GENCALL_DAT_ACK:
		/* BUSY = 1, DONE = 0 */
		device->status = I2C_STATUS_BUSY | I2STAT_SLV_RCV_PRE_GENCALL_DAT_ACK;
		if (device->idx < device->length)
		{
			*(device->datptr + device->idx) = (U8) device->regptr->I2DAT;
			device->idx++;
		}
		/* if received data length is greater than specified length
		 * all next data will be lost */ 
		device->regptr->I2CONSET = I2CON_AA;
		device->regptr->I2CONCLR = I2CON_SI;
		break;
		
	/* Data has been received and NOT ACK has been return
	 * as general call address */
	case I2STAT_SLV_RCV_PRE_GENCALL_DAT_NACK:
		/* BUSY = 0, DONE = 0 */
		device->status = I2STAT_SLV_RCV_PRE_GENCALL_DAT_NACK | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = (I2CON_SI | I2CON_AA);
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
	
	/* A stop condition has been received */
	case I2STAT_SLV_RCV_STASTO_SLVREC_SLVTRX:
		/* BUSY = 0, DONE = 1 */
		device->status = I2C_STATUS_DONE | I2STAT_SLV_RCV_STASTO_SLVREC_SLVTRX;
		device->regptr->I2CONCLR = (I2CON_SI | I2CON_AA);
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;
	
		
	// Other status must be captured
	default:
		/* Else... */
		/* BUSY = 0, DONE = 0 */
		device->status = device->regptr->I2STAT | I2C_STATUS_ERROR;
		device->regptr->I2CONCLR = (I2CON_SI | I2CON_AA);
		/* Call callback function */
		device->cbs();
		/* Disable interrupt */
		I2C_DisableInt (I2Cdev);
		break;	  
	}
}


/***********************************************************************
 * Function: I2C_EnableInt
 * Purpose: Enable interrupt for I2C device
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * Returns: None
 **********************************************************************/
void I2C_EnableInt (S32 I2Cdev)
{	
	if(I2Cdev == (S32) (&i2ccfgdat[0]))
	{
		VIC_EnableInt (I2C0_INT);
	}
	else if (I2Cdev == (S32) (&i2ccfgdat[1]))
	{
		VIC_EnableInt (I2C1_INT);
	}
	else if (I2Cdev == (S32) (&i2ccfgdat[2]))
	{
		VIC_EnableInt (I2C2_INT);
	}
    return;
}


/***********************************************************************
 * Function: I2C_DisableInt
 * Purpose: Disable interrupt for I2C device
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * Returns: None
 **********************************************************************/
void I2C_DisableInt (S32 I2Cdev)
{	
	if (I2Cdev == (S32) (&i2ccfgdat[0]))
	{
		VIC_DisableInt (I2C0_INT);
	}
	else if (I2Cdev == (S32) (&i2ccfgdat[1]))
	{
		VIC_DisableInt (I2C1_INT);
	}
	else if (I2Cdev == (S32) (&i2ccfgdat[2]))
	{
		VIC_DisableInt (I2C2_INT);
	}
}


/**********************************************************************
 * I2C driver public functions
 *********************************************************************/

/***********************************************************************
 * Function: I2C_Init
 * Purpose: Init I2C device 
 * Parameters:
 *     I2CPortNum: I2C port number (0, 1 or 2)
 *     I2CMode: I2C mode (0 or 1)
 * 	   OwnSlvAdr: Own I2C slave address in SLAVE mode 
 * (8 bit address ORed with General Call enable bit - 0x01)
 *	   ClkRate: I2C Clock rate (Hz)
 * Returns: The pointer to a I2C config structure or NULL
 **********************************************************************/
S32 I2C_Init (U32 I2CPortNum, U32 I2CMode, U8 OwnSlvAdr, U32 ClkRate)
{
	I2C_CFG_T *i2ccfgptr;
	
	// I2C numport selection 
	if ((I2CPortNum >= 0) && (I2CPortNum <= 2))
	{
		i2ccfgptr = &i2ccfgdat[I2CPortNum];
	}
	else
	{
		return 0;
	}

    /* has the selected I2C been previously initialized? */
    if (i2ccfgptr->init == FALSE)
    {
        /* Device not initialized and it is usable, so set it to
           used */
    	i2ccfgptr->init = TRUE;
        
    	 /* Save address of register block */
        switch (I2CPortNum)
        {
        case I2C_PORT_0:
        	i2ccfgptr->regptr = I2C0;
        	// Enable power
        	SCB_EnablePPWR (PCI2C0);
        	// Set peripheral clock divider to 2 from CCLK
        	SCB_SetPCLKDiv (PCLK_I2C0, CCLK_DIV_2);
        	// Enable function pins according
//        	PINSEL_Set (PORT_0, 27, FUNC_1);
//        	PINSEL_Set (PORT_0, 28, FUNC_1);
        	break;
        	
        case I2C_PORT_1:
        	i2ccfgptr->regptr = I2C1;
        	// Enable power
	    	SCB_EnablePPWR (PCI2C1);
	    	// Set peripheral clock divider to 2 from CCLK
	    	SCB_SetPCLKDiv (PCLK_I2C1, CCLK_DIV_2);
        	// Enable function pins according
//        	PINSEL_Set (PORT_0, 0, FUNC_3);
//        	PINSEL_Set (PORT_0, 1, FUNC_3);
        	break;
        	
        case I2C_PORT_2:
        	i2ccfgptr->regptr = I2C2;
        	// Enable power
        	SCB_EnablePPWR (PCI2C2);
        	// Set peripheral clock divider to 2 from CCLK
        	SCB_SetPCLKDiv (PCLK_I2C2, CCLK_DIV_2);
        	// Enable function pins according
//        	PINSEL_Set (PORT_0, 10, FUNC_2);
//        	PINSEL_Set (PORT_0, 11, FUNC_2);
        	break;
        }

        if (I2C_Config ((S32) i2ccfgptr, I2CMode, OwnSlvAdr, ClkRate) 
        		== _ERROR)
        {
        	return 0;
        }

        // Set I2C operation to default
        i2ccfgptr->regptr->I2CONCLR = (I2CON_AA | I2CON_STA | 
									I2CON_STO | I2CON_SI | I2CON_EN);
        i2ccfgptr->regptr->I2CONSET = I2CON_EN;
        
        // Set Handler and CBS function used in ASYNC mode to NULL
        i2ccfgptr->handler = NULL;
        i2ccfgptr->cbs = NULL;
    }
    // The device has been already init 
    else
    {
    	return 0;
    }
    
