iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_i2c_driver.c
    return (S32) i2ccfgptr;
}


/***********************************************************************
 * Function: I2C_Config
 * Purpose: Init I2C device 
 * Parameters:
 *     I2Cdev: Pointer to I2C device 
 *     I2CMode: I2C mode (0 or 1)
 * 	   OwnSlvAdr: Own I2C slave address in SLAVE mode 
 * (8 bit address ORed with General Call enable bit - 0x01)
 *	   ClkRate: I2C Clock rate (Hz)
 * Returns: Status of Progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 I2C_Config (S32 I2Cdev, U32 I2CMode, U8 OwnSlvAdr, U32 ClkRate)
{
	I2C_CFG_T *i2ccfgptr = (I2C_CFG_T *) I2Cdev;
	U32 temp;
	
	if (i2ccfgptr->init == FALSE)
	{
		return _ERROR;
	}
	
	// Set I2C mode with its address if device is in slave mode
	switch (I2CMode)
	{
	case I2C_MASTER_MODE:
		i2ccfgptr->mastermode = TRUE;
		break;
		
	case I2C_SLAVE_MODE:
		i2ccfgptr->mastermode = FALSE;
		i2ccfgptr->regptr->I2ADR = (U32) OwnSlvAdr;
		break;
		
	default:
		return _ERROR;
		break;
	}
	
	// Get PCLK of I2C controller
	if (I2Cdev == (S32) (&i2ccfgdat[0]))
	{
		temp = (SCB_GetPCLK (PCLK_I2C0)) / ClkRate;
	}
	else if (I2Cdev == (S32) (&i2ccfgdat[1]))
	{
		temp = (SCB_GetPCLK (PCLK_I2C1)) / ClkRate;
	}
	else if (I2Cdev == (S32) (&i2ccfgdat[2]))
	{
		temp = (SCB_GetPCLK (PCLK_I2C2)) / ClkRate;
	}
	else
	{
		return _ERROR;
	}
		
	/* Set the I2C clock value to register */
	i2ccfgptr->regptr->I2SCLH = (U32)(temp / 2);
	i2ccfgptr->regptr->I2SCLL = (U32)(temp - i2ccfgptr->regptr->I2SCLH);
	
	return _NO_ERROR;
}

/***********************************************************************
 * Function: I2C_Close
 * Purpose: Close the I2C device 
 * Parameters:
 *     I2Cdev: Pointer to I2C device
 * Returns: Status of Progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 I2C_Close (S32 I2Cdev)
{
    I2C_CFG_T *i2ccfgptr = (I2C_CFG_T *) I2Cdev;
    
    if (i2ccfgptr->init == TRUE)
	{
    	if (I2Cdev == (S32) (&i2ccfgdat[0]))
    	{
	    	// Turn-off power
	    	SCB_DisablePPWR (PCI2C0);
    	}
    	else if (I2Cdev == (S32) (&i2ccfgdat[1]))
    	{
	    	// Turn-off power
	    	SCB_DisablePPWR (PCI2C1);
    	}
    	else if (I2Cdev == (S32) (&i2ccfgdat[2]))
    	{
	    	// Turn-off power
	    	SCB_DisablePPWR (PCI2C2);
    	}
    	else
    	{
    		return _ERROR;
    	}
    	
        /* Set I2C as uninitialized */
    	i2ccfgptr->init = FALSE;
        
        /* disable I2C interrupt */
    	I2C_DisableInt(I2Cdev);
	    
	    /* Disable device */
	    i2ccfgptr->regptr->I2CONCLR = (I2CON_AA | I2CON_STA | 
				I2CON_STO | I2CON_SI | I2CON_EN);
	}

    return _NO_ERROR;
}


/***********************************************************************
 * Function: I2C_WritePoll
 * Purpose: Write a number of bytes in polling mode
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * 		SlvAdr: I2C slave address to send (available in master)
 * 		buff: pointer to buffer data.
 * 		length: length of data to be sent (in byte) 
 * Returns: count of actual data sent
 **********************************************************************/
S32 I2C_WritePoll (S32 I2Cdev,
				U8 SlvAdr,
				void* buff,
				U32 length)
{
	I2C_CFG_T* device = (I2C_CFG_T *) I2Cdev;
	I2C_Type* i2cregs = device->regptr;
	U8* dataptr = (U8 *) buff;
	U32 count = 0;
	U32 errcode = 0;
	S32 volatile exit_flag = 0;
	
	if (device->init == TRUE)
	{
		/* if master mode selected */
		if (device->mastermode == TRUE)
		{
			/* Start condition */
			if ((errcode = I2C_Start(i2cregs)) 
					!= I2STAT_MSTR_TRSMT_START)
	    	{
				// Save current I2C operation status
				device->status = errcode | I2C_STATUS_ERROR;
	    		goto exit_0;
	    	}
			
			/* Send slave address + WR direction bit = 0 */
	    	if ((errcode = I2C_SendByte(i2cregs, SlvAdr))
	    			!= I2STAT_MSTR_TRSMT_SLAW_ACK)
	    	{
				// Save current I2C operation status
				device->status = errcode | I2C_STATUS_ERROR;
	    		goto exit_0;
	    	}
	    	
	    	/* Send a number of data bytes */
	    	while (count < length)
	    	{
	    		if ((errcode = I2C_SendByte(i2cregs, *dataptr))
	    				!= I2STAT_MSTR_TRSMT_DAT_ACK)
	    		{
	    			// Save current I2C operation status
	    			device->status = errcode | I2C_STATUS_ERROR;
	    			break;
	    		}
	    		dataptr++;
	    		count++;
	    	}
	    	
	    	if (count == length)
	    	{
	    		// I2C Operation done!
	    		device->status = I2C_STATUS_DONE;
	    	}
	    	
	    	exit_0:
	    	/* Stop condition */
	    	I2C_Stop (i2cregs);
		}
		
		/* if slave mode selected */
		else
		{
			/* Set AA bit to ack command on I2C bus */
			i2cregs->I2CONSET = I2CON_AA;
			/* Clear Si bit to be ready ... */
			i2cregs->I2CONCLR = (I2CON_SI | I2CON_STA | I2CON_STO);
			
			/* Check for exit flag == 1 */
			while (exit_flag == 0)
			{
				/* Check SI flag ready */
				if (i2cregs->I2CONSET & I2CON_SI)
				{					
					switch (i2cregs->I2STAT)
					{
					/* Own SLA+R has been received, ACK has been returned */
					case I2STAT_SLV_TRSMT_SLAR_ACK:	
		    			if (count < length)
		    			{
		    				i2cregs->I2DAT = (U32) *dataptr;
			    			dataptr++;
			    			count++;
		    			}	    			
		    			i2cregs->I2CONSET = I2CON_AA;
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    			
		    		/* Data has been transmitted, ACK has been received */
		    		case I2STAT_SLV_TRSMT_DAT_ACK:
		    			if (count < length)
		    			{
		    				i2cregs->I2DAT = (U32) *dataptr;	
		    				dataptr++;
		    				count++;
		    			}    				
		    			i2cregs->I2CONSET = I2CON_AA;
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    			
		    		/* Data has been transmitted, NACK has been received */
		    		case I2STAT_SLV_TRSMT_DAT_NACK:
		    			// Save current I2C status 
		    			device->status = i2cregs->I2STAT | I2C_STATUS_DONE;
		    			i2cregs->I2CONSET = I2CON_AA;
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			exit_flag = 1;
		    			break;
		    			
		    		// Other status must be captured
		    		default:
		    			// Save current I2C operation status
		    			device->status = i2cregs->I2STAT | I2C_STATUS_ERROR;
		    			// Exit loop
		    			exit_flag = 1;
		    			break;
					}
				}
			}
			
