iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_i2c_driver.c
			/* Clear AA bit to disable ack on I2C bus */
			i2cregs->I2CONCLR = I2CON_AA;
		}
	}
	
	return (S32) count;
}


/***********************************************************************
 * Function: I2C_WriteAsync
 * Purpose: Write a number of bytes in ASYNC (interrupt) mode
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * 		SlvAdr: I2C slave address to send (available in master)
 * 		buff: pointer to buffer data.
 * 		length: length of data to be sent (in byte) 
 * Returns: status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 I2C_WriteAsync (S32 I2Cdev,
					U8 SlvAdr,
					void* buff,
					U32 length)
{
	I2C_CFG_T* device = (I2C_CFG_T *) I2Cdev;
	I2C_Type* i2cregs = device->regptr;
	
	if (device->init == TRUE)
	{		
		device->datptr = (U8 *) buff;
		device->idx = 0;
		device->length = length;
		
		/* if master mode selected */
		if (device->mastermode == TRUE)
		{
			device->slaveaddr = SlvAdr;
			device->handler = I2C_MTXHandler;
			device->status = I2C_STATUS_BUSY;
			i2cregs->I2CONCLR = (I2CON_AA | I2CON_SI | I2CON_STO);
			i2cregs->I2CONSET = I2CON_STA;
		}
		/* if slave mode selected */
		else
		{
			device->handler = I2C_STXHandler;
			device->status = I2C_STATUS_BUSY;
			i2cregs->I2CONCLR = (I2CON_STA | I2CON_SI | I2CON_STO);
			i2cregs->I2CONSET = I2CON_AA;
		}
		
		/* Enable I2C interrupt for next necessary step */
		I2C_EnableInt (I2Cdev);
	}
	else
	{
		return _ERROR;
	}
	
	return _NO_ERROR;
}

/***********************************************************************
 * Function: I2C_ReadPoll
 * Purpose: Read a number of bytes in polling mode
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * 		SlvAdr: I2C slave address to send (available in master)
 * 		buff: pointer to buffer data.
 * 		length: length of data to be read (in byte) 
 * Returns: count of actual data sent
 **********************************************************************/
S32 I2C_ReadPoll (S32 I2Cdev,
				U8 SlvAdr,
				void* buff,
				U32 length)
{
	I2C_CFG_T* device = (I2C_CFG_T *) I2Cdev;
	I2C_Type* i2cregs = device->regptr;
	U8* dataptr = (U8 *) buff;
	U32 count = 0;
	U32 errcode = 0;
	U8 tmp;
	S32 volatile exit_flag = 0;
	
	if (device->init == TRUE)
	{
		/* if master mode selected */
		if (device->mastermode == TRUE)
		{
			/* Start condition */
			if ((errcode = I2C_Start(i2cregs)) 
					!= I2STAT_MSTR_RCV_START)
	    	{
				// Save current I2C operation status
				device->status = errcode | I2C_STATUS_ERROR;
	    		goto exit_1;
	    	}
			
			/* Send slave address + RD direction bit = 1*/
	    	if ((errcode = I2C_SendByte(i2cregs, (SlvAdr | 0x01)))
	    			!= I2STAT_MSTR_RCV_SLAR_ACK)
	    	{
				// Save current I2C operation status
				device->status = errcode | I2C_STATUS_ERROR;
	    		goto exit_1;
	    	}
	    	
	    	/* Read a number of data bytes */
	    	while (count < length)
	    	{
	    		if (count == (length - 1))
	    		{
	    			if ((errcode = I2C_GetByte(i2cregs, &tmp, FALSE)) 
	    					!= I2STAT_MSTR_RCV_DAT_NACK)
	    			{
	    				// Save current I2C operation status
	    				device->status = errcode | I2C_STATUS_ERROR;
	    				goto exit_1;
	    			} 
	    		}
	    		else
	    		{
	    			if ((errcode = I2C_GetByte(i2cregs, &tmp, TRUE)) 
	    					!= I2STAT_MSTR_RCV_DAT_ACK)
	    			{
	    				// Save current I2C operation status
	    				device->status = errcode | I2C_STATUS_ERROR;
	    				goto exit_1;
	    			}
	    		}
	    		*dataptr = tmp;
	    		dataptr++;
	    		count++;
	    	}
	    	
	    	if (count == length)
	    	{
	    		// I2C Operation done!
	    		device->status = I2C_STATUS_DONE;
	    	}
	    	
	    	exit_1:
	    	/* Stop condition */
	    	I2C_Stop(i2cregs);
		}
		
		/* if slave mode selected */
		else
		{
			/* Set AA bit to ack command on I2C bus */
			i2cregs->I2CONSET = I2CON_AA;
			/* Clear Si bit to be ready ... */
			i2cregs->I2CONCLR = (I2CON_SI | I2CON_STA | I2CON_STO);
			
			/* Check for exit flag == 1 */
			while (exit_flag == 0)
			{
				/* Check SI flag ready */
				if (i2cregs->I2CONSET & I2CON_SI)
				{
					switch (i2cregs->I2STAT)
					{
					/* Own slave address has been received, 
					 * ACK has been returned */
					case I2STAT_SLV_RCV_SLAW_ACK:
		    			i2cregs->I2CONSET = I2CON_AA;
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    			
			    	/* Previously addressed with own SLA; 
			    	 * DATA byte has been received; 
			    	 * ACK has been returned */
		    		case I2STAT_SLV_RCV_PRE_SLA_DAT_ACK: 
		    			if (count < length)
		    			{
		    				*dataptr = (U8) i2cregs->I2DAT;
							dataptr++;
							count++;
		    			}
						i2cregs->I2CONSET = I2CON_AA;					
						i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    			
		    		/* Previously addressed with own SLA; 
		    		 * DATA byte has been received; 
		    		 * NOT ACK has been returned */
		    		case I2STAT_SLV_RCV_PRE_SLA_DAT_NACK:
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			break;	
		    			
		    		/* General call ack */	
		    		case I2STAT_SLV_RCV_GENCALL_ACK:
		    			i2cregs->I2CONSET = I2CON_AA;
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    		
		    		/* DATA has been received, ACK hasn been return */
		    		case I2STAT_SLV_RCV_PRE_GENCALL_DAT_ACK:
		    			if (count < length)
		    			{
		    				*dataptr = (U8) i2cregs->I2DAT;
							dataptr++;
							count++;
		    			}
						i2cregs->I2CONSET = I2CON_AA;					
						i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    		
		    		/* DATA has been received, ACK hasn been return */
		    		case I2STAT_SLV_RCV_PRE_GENCALL_DAT_NACK:
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			break;
		    		
		    		/* A Stop condition */
		    		case I2STAT_SLV_RCV_STASTO_SLVREC_SLVTRX:
	    				// Save current I2C operation status
	    				device->status = i2cregs->I2STAT | I2C_STATUS_DONE;
		    			i2cregs->I2CONCLR = I2CON_SI;
		    			exit_flag = 1;
		    			break;
		    			
	    			// Other status must be captured
		    		default:
	    				// Save current I2C operation status
	    				device->status = i2cregs->I2STAT | I2C_STATUS_ERROR;
	    				i2cregs->I2CONCLR = I2CON_SI;
		    			exit_flag = 1;
		    			break;
					}
				}
			}
			
