iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_i2c_driver.c
			/* Clear AA bit to disable ack on I2C bus */
			i2cregs->I2CONCLR = I2CON_AA;
		}
	}

	return (S32) count;
}


/***********************************************************************
 * Function: I2C_ReadAsync
 * Purpose: Read a number of bytes in ASYNC (interrupt) mode
 * Parameters:
 *     	I2Cdev: Pointer to I2C device
 * 		SlvAdr: I2C slave address to send (available in master)
 * 		buff: pointer to buffer data.
 * 		length: length of data to be read (in byte) 
 * Returns: status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 I2C_ReadAsync (S32 I2Cdev,
					U8 SlvAdr,
					void* buff,
					U32 length)
{
	I2C_CFG_T* device = (I2C_CFG_T *) I2Cdev;
	I2C_Type* i2cregs = device->regptr;
	
	if (device->init == TRUE)
	{
		device->datptr = (U8 *) buff;
		device->idx = 0;
		device->length = length;
		
		/* if master mode selected */
		if (device->mastermode == TRUE)
		{
			device->slaveaddr = SlvAdr;
			device->handler = I2C_MRXHandler;
			device->status = I2C_STATUS_BUSY;
			i2cregs->I2CONCLR = (I2CON_AA | I2CON_SI | I2CON_STO);
			i2cregs->I2CONSET = I2CON_STA;
		}
		/* if slave mode selected */
		else
		{
			device->handler = I2C_SRXHandler;
			device->status = I2C_STATUS_BUSY;
			i2cregs->I2CONCLR = (I2CON_STA | I2CON_SI | I2CON_STO);
			i2cregs->I2CONSET = I2CON_AA;
		}
		
		/* Enable I2C interrupt for next necessary step */
		I2C_EnableInt (I2Cdev);
	}
	else
	{
		return _ERROR;
	}
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: I2C_SetCBS
 * Purpose: Configure Call back function for I2C device used in SYNC mode
 * Parameters: 
 * 		I2Cdev: pointer to I2C device
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 I2C_SetCBS (S32 I2Cdev, void *pCBS)
{
	I2C_CFG_T* device = (I2C_CFG_T *) I2Cdev;
	
	if (device->init == FALSE)
	{
		return _ERROR;
	}
	
	device->cbs = pCBS;
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: I2C_GetStatus
 * Purpose: Get current status of I2C device operation 
 * Parameters: 
 * 		I2Cdev: pointer to I2C device
 * Returns: None
 **********************************************************************/
U32 I2C_GetStatus (S32 I2Cdev)
{
	I2C_CFG_T* device = (I2C_CFG_T *) I2Cdev;
	return device->status;
}


/***********************************************************************
 * Function: I2C0_ISR
 * Purpose: Common interrupt handler for I2C0 device
 * Parameters: None
 * Returns: None
 **********************************************************************/
void I2C0_ISR (void)
{
    i2ccfgdat[0].handler((S32) (&i2ccfgdat[0]));
    // update VIC addr
    VIC_Ack ();
}


/***********************************************************************
 * Function: I2C1_ISR
 * Purpose: Common interrupt handler for I2C1 device
 * Parameters: None
 * Returns: None
 **********************************************************************/
void I2C1_ISR (void)
{
    i2ccfgdat[1].handler((S32) (&i2ccfgdat[1]));
    // update VIC addr
    VIC_Ack ();
}


/***********************************************************************
 * Function: I2C2_ISR
 * Purpose: Common interrupt handler for I2C2 device
 * Parameters: None
 * Returns: None
 **********************************************************************/
void I2C2_ISR (void)
{
    i2ccfgdat[2].handler((S32) (&i2ccfgdat[2]));
    // update VIC addr
    VIC_Ack ();
}
